/**
 * системная архитектура: спутниковая система навигации.
 * satellite navigation system (SNS)
 *
 * - американская система глобального позиционирования (Global Positioning System - GPS)
 * - российская глобальная навигационная спутниковая система (GLObal NAvigation Satellite System - GLONASS)
 * - европейская (GALILEO)
 *
 * а мы разработаем свою реализацию:
 * - открытая система глобального спутникового позиционирования (the Open System of Global Satellite Positioning - OSGSP)
 *
 *
 * Концепция
 * - предоставлять заказчикам эффективные и доступные услуги системы OSGSP.
 *
 * Функциональные требования
 * - предоставлять услуги OSGSP.
 * - управлять системой OSGSP.
 * - поддерживать работу системы OSGSP.
 *
 * Нефункциональные требования
 * - высокий уровень надежности, обеспечивающий адекватное гарантийное обслуживание.
 * - достаточная точность, удовлетворяющая текущие и будущие потребности пользователей.
 * - резервирование критических функциональных возможностей системы OSGSP.
 * - широкая автоматизация, минимизирующая операционные издержки.
 * - легкость сопровождения, снижающая стоимость поддержки.
 * - возможность расширения функциональных возможностей системы OSGSP.
 * - продолжительное обслуживание, особенно элементов, расположенных в космосе.
 *
 * Ограничения
 * - соответствие международным стандартам.
 * - максимальное использование коммерческого аппратного и программного обеспечения.
 */
package com.shako.root.isbn_0_201_89551_x.section3._1_osgsp;
