/**
 * Объектная модель.
 *
 *
 * Объектно-ориентированная технология:
 *   |
 *   +-- Объектная модель проектирования (объектная модель)
 *          |
 *          +-- абстракция
 *          |
 *          +-- инкапсуляция
 *          |
 *          +-- модульность
 *          |
 *          +-- иерархия
 *          |
 *          +-- конроль типов
 *          |
 *          +-- параллелизм
 *          |
 *          +-- персистентность
 *
 *
 *
 *
 */
package com.shako.root.isbn_0_201_89551_x.section1.chapter2;